Revit 2026 API

# DirectShapeSetShape(IListGeometryObject, DirectShapeTargetViewType) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetShape(
	IList<GeometryObject> pGeomArr,
	DirectShapeTargetViewType viewType
)
```
```vb
Public Sub SetShape (
	pGeomArr As IList(Of GeometryObject),
	viewType As DirectShapeTargetViewType
)
```
```cpp
public:
void SetShape(
	IList<GeometryObject^>^ pGeomArr,
	DirectShapeTargetViewType viewType
)
```
```fsharp
member SetShape :
        pGeomArr : IList<GeometryObject> *
        viewType : DirectShapeTargetViewType -> unit
```

#### Parameters

pGeomArr IListGeometryObject

viewType DirectShapeTargetViewType

#### Reference

DirectShape Class

SetShape Overload

Autodesk.Revit.DB Namespace